{"pageProps":{"post":{"slug":"控制流水","title":"控制流水","mdsource":"md/控制流水.md","date":"2020-01-11","category":"理财"},"content":"title: 控制流水\ndate: 2020-01-09 19:18:39\n------\n\n从一开始，我有控制流水的习惯，后面开始计划FIRE，所以控制流水目前为止在我这里慢慢变得更加重要。控制流水之后，很多钱可以去做风险投资，增值，按照赵国M2增长率，货币贬值率是4%，如果你的钱没有年增长超过4%，那肯定是亏钱。\n经济学得东西不再赘述，这里会说太多，不是本文的主题。\n\n继续说控制流水的手段:\n## 学会记账\n每个季度做一次，一年做4次计算，算出可节省不可节省的部分。\n\n## 节省电子产品花费\n做好第一条之后，你会发现买电子产品太费了,但是它们又是必需品，那么如何控制电子产品支出？\n>- 不买最新,新的虽好，但是你去计算他的价格曲线的话，前面1-2个月价格跌的很快，你只需要忍一个月就可以节省大几百块。\n> - 买官翻机，或者二手,用完了再当二手卖。\n> - 机器用的更久一点，但是不要求你用到报废。\n> - 机器不要买太老，不然会导致你用不了多久。\n真正的损耗计算其实是\n```\n每年花费=(买入价-卖出价)/时间.\n```\n你会发现如果你选择比较保值的电子产品，只要不坏掉，卖掉时其实你**save more money**。\n所以，这里需要补充一条：推荐买iphone，尼康这种超级保值的品牌。\n我自己目前是:一部水货mba用了3年+，2800的iphone se用了3年+,之前的相机买入就是二手，最近挂在咸鱼准备出掉，用了一年多亏了800。\n回到前面说的你会发现电子产品太费了，实际寿命又短，又是必需品，是不是他妈的那些公司赚翻了，对，是的，所以你可以选择买他们的股票，不是通过直接持股，而是通过基金，这个行业实在是盈利非常厉害，你选择电子半导体的基金，一年赚20%不是问题，而且亏钱概率极低，推荐一只基金，**广发纳斯达克100指数C**。\n\n## 节省汽车花费\n通过上面电子产品的花费，你会发现你的整个对待手里东西的观念需要改掉，不要只当手里的东西是一个工具，其实他是一笔固定资产。\n但是，车子在很多中国人心中的地位不一样，他不是一个工具，他是一个面子，要买好的，全新的，豪华品牌。\n如果，你有这种思想那么我告诉你，这个社会99%的人会落入贫困陷阱，如果你不是富二代，只是一个白领，或者IT从业者，以你目前的思想200%会落入这个陷阱。\n继续，我对车子的观念是：车子是个必需品，工具，固定资产。\n> - 没车子这个必须的工具就是不方便，每年投入大量的时间在赶路。很多时候时间就是生命，就是钱。\n> - 子买入就在亏钱，但是始终是固定资产，即使你撞报废了，保险公司会赔你，亏钱的速度可以控制，就像我前面说的电子产品，都能控制。\n车子花费的手段:\n> - 不要选择新车，选择二手车，因为新车税太贵，而且前3年每年折损最快的。价格最好控制在8W以内，且很保值的车型，这里推荐只能买丰田本田了\n，这个价格内的，基本是5年以上的车龄，只有日本车5年以上的故障率低，不烧机油，不过现在涡轮增压技术普及之后，日系也有一点点烧，不过在接受范围内，每年的保养+保险+油费都很低。\n> -  如果你不愿接受二手车，没有能力去鉴定二手，全新车子推荐买**飞度**了，只有这个车子价格狗低。虽然有很多车子保值率接近飞度，但是你需要支出一大笔钱，比如 丰田普拉多，RAV。虽然每年折旧率差不多，但是你没有多少活钱在手里（即使有无息贷款也是有期限的），没有活钱在手里就会错过很多投资机会，另外更贵的车型保险更高，维修保养费用的话其实同品牌下的不同车型差不多。(一定要精打细算)\n> - 拉拼车乘客,其实很多车一公里油钱只有4角5角，很低了，所以无所谓，但是每年折损和保险也在消耗，如果每年拉一些同事，或者过年回家拼个乘客，总体的成本控制更低。\n> - 作为*2*的补充,如果你不想买二手又不想缴税，推荐你多去4S店加几个销售微信，让他们给你留意几乎全新的二手车，一年几个月就会有，那种3000公里不到的新车，作为二手车买入是没有税的，而且车价也有一定的折损，你接盘几乎全新的车子应该是满足你的要求。\n\n\n## 买书(非必需品)\n其他还有很多非必需品，我不一一举例，我只举例买书，这点很多人也有这个习惯，我一年大概买了10多本书，如果都全新的，其实并不贵，但是我们需要在尽量节省钱的情况下完成非必需品的消费。最初我喜欢逛二手书店，去蹲几个小时淘书，后面我发现多抓鱼这个网站，我从`多抓鱼`买入，看完再一起卖掉，基本没亏钱，亏个快递费，甚至有的书因为绝版，还在涨价卖出就赚了。\n\n## 控制服务业消费\n咖啡很贵，外面吃大餐很贵，很奢侈，仔细算下我一年吃大餐和咖啡消费，快1W了，毕竟10顿大餐就好几千。如果省了这笔钱，去做高风险投资，毕竟又不是经济危机，大赚还是很有可能的，亏一半也不心疼。\n\n```\n这里只举几个例子，算是几个大头，不说更多了，拿几个必需消费和非必须消费让您自己去思考怎么操作，毕竟东西太多品类够杂，不能说全。别忘了第一点学会记账是开始需要做的。\n```\n\n当然，控制流水（省钱）的目的并不仅仅是为了存钱而已，几乎没有人因为存钱，就可以老年不落入贫困陷阱。而你存钱了之后，去做风险投资，然后风险投资带来的收益达到你每月支出的两倍，才有希望脱离贫困陷阱。如果被动收入是自己收入的2倍，基本就可以fire（不是FIRE）你的boss，提前退休。等你被动收入狗高，如果你不辞职，你起码可以大手笔买电子产品，豪华汽车也就可以了。如果你改变不了自己对车子的观念，那么看看巴菲特，他甚至不买全新车，在他们不用这么高的税的情况下（赵国税率定的很高，是因为收税困难所以加高税率，只收割一些车主和老实缴税的人或者企业。），看看还有其他理财大师都开什么车，你一个破白领何必呢。\n\n","lang":"cn"},"__N_SSG":true}