{"pageProps":{"post":{"slug":"androidremotebuildwithdocker","title":"AndroidRemoteBuildWithDocker","mdsource":"https://raw.githubusercontent.com/BruceWind/AndroidRemoteBuildWithDocker/master/README.md","date":"2021-09-10","category":"Open-source"},"content":"# AndroidRemoteBuildWithDocker\n\n[简体中文](https://github.com/BruceWind/AndroidRemoteBuildWithDocker/blob/main/README_zh.md)\n\nSome people building large Android projects on laptops may got depressed in building costs such as time and battery usage.\nSo some people have the need of a powerful and portable workstation. It is impossible but you can build on remote desktop.\n\nThe trouble was on me as well, however, I fixed it. I used to establish a remote-builder on my powerful desktop. I control the remote-builder by not only terminal but also Android studio.\nA problem is that remote-builder configuring with Android will spend lots time. In building it on a cloud service or new desktop, tremendous steps of configuration make me tired. So I made this repo integrate with a couple of technologies: virtualization technolgy and a remote-builder tool.\n\n[Mainframer](https://github.com/buildfoundation/mainframer), the remote-builder tool is can do two things:  syncing files and executing build commands. Its official explain: \n> A tool that executes a command on a remote machine while syncing files back and forth. The process is known as remote execution (in general) and remote build (in particular cases).\n> It works via pushing files to the remote machine, executing the command there and pulling results to the local machine.\n\nAnd I have to tell you that it work not only temrinal but also Android studio.\n\nBefore I said that remote-builder configuring with Android will spend lots time but we have virtualization technology, such as `Docker` and `Kubernetes`, which I've used in everywhere is high-performance and easy to use and backup. \n***In this repo, I make a docker image that contains Android develop environment and [Mainframer](https://github.com/buildfoundation/mainframer)***. \nYou can run it on a powerful/high-performance desktop which can be a server. It is not required that the desktop/server and your laptop **under one LAN**. In case the desktop/server you can connect from anywhere, it can be set the docker image. Furthermore, you can put the docker image on a cloud service, such as, google or amazon cloud server, for your remote and powerful building. Cloud services are elastic in performance and price. Besides, you may think cloud server is high-latency. I have to explain that latency won't affect your build experience because the host does not communicate with your laptop multiple times during the build process, except during the first build. Copying files only in before and after buiding build. And the full-file-copying task only once.\n\nTo sum up, I explained that the repo works for remote-building and it solve troubles about laptop's performance and battery. So after you establish a remote-builder, you can bring you laptop to coffee shop, grass and sunshine without electric charging. \n\nBelow I explain how to set up it.\n\n## Server configuration\n<details><summary>click to expand</summary>\n\nFirst step is building docker image. In your terminal, run this command `docker build -t mainframer-docker .`\n\nLast step is starting it: run `docker run --restart always -d -p 23:22 mainframer-docker`. \n\nNow, if there is no error,  run `docker container ls | grep mainframer-docker` to detect if it is started. May everything is very well.\n</details>\n\n## Client configuration\n<details><summary>click to expand</summary>\n  \nBeside the project specific setup we need 2 more things, an ssh-key that is used to easily communicate between client and server. And a ssh configuration for our server.\n\n  ```bash\n  ssh-keygen -t rsa -f ~/.ssh/remote-builder -q -N \"\"\n  # for mac, you may need to  run: brew install ssh-copy-id\n  # At the next command, you must input the password:root for ssh-copy\n  ssh-copy-id -i ~/.ssh/remote-builder  -p 23 root@127.0.0.1\n\n  echo -e \"Host remote_builder\n            User root \n            HostName 127.0.0.1 \n            Port 23 \n            IdentityFile ~/.ssh/remote-builder \n            PreferredAuthentications publickey \n            ControlMaster auto \n            ControlPath /tmp/%r@%h:%p \n            ControlPersist 1h\" >> ~/.ssh/config\n  ```\n  **DONT FORGET TO REPLACE IP ADDRESS**\n\nTo verify the SSH configuration of the docker works very well, you can run: `ssh remote_builder`. If there is no error, the ssh-conf must be correct.\n\nFor Android you can now copy the folder  `.mainframer` and file `./mainframer.sh` into your project folder. Then you can run `bash ./mainframer.sh ./gradlew assembleDebug` to make sure it works ok.\n\n**And now enjoy faster builds**\n\nBtw, you might like to run this within your Android Studio or Jetbrian IDEA. Please follow steps below:\n\n### Build with Android Studio\n\n1. open Android Studio to open your project.\n\n3. click **Run → Edit Configuration → +**.\n\n4. select your **Android App**.\n\n5. name a new name, e.g. remote-build.\n\n6. in **Module**, select submodule name, may be `app`.\n\n7. in **Before Launch**, click **-** to delete `Gradle-aware Make`\n\n8. in **Before Launch**, click **+**, add **Run External Tool**, input a new name，like `remote assembleDebug`.\n\n9.  in **Program**, input `bash`.\n\n10. in **Parameters** input `mainframer.sh ./gradlew :app:assembleDebug -Pandroid.enableBuildCache=true`\n\n11. The last step, in **Working directory** , input `$ProjectFileDir$`.\n\n\n</details>\n\n## In addition\n\n**How to install another SDK?**\n\n> In most circumstances, you don't need to do it. SDK downloading will automatically execute。\n\nModify Dockerfile to rebuild. Or follow these steps:\n\n1. start your docker.\n2. run `ssh remote_builder` to enter your docker container. Or use the docker command to enter it.\n3. by the time you entered the bash on your docker container, run: \n\n    `/sdk/tools/bin/sdkmanager--install \"ndk;21.0.6113669\" --channel=3`.\n\n**Mainframer also can build other kinds of projects**\nYou can fork this project to edit `Dockerfile` to make it work for your project.\n\n\n\n**More features of Mainframer:**\n[mainframer/v2.1.0 doc](https://github.com/buildfoundation/mainframer/tree/v2.1.0/samples/gradle-android)\n","lang":"en"},"__N_SSG":true}