{"pageProps":{"post":{"slug":"node_subscription_from_cloudflare_workers.md","title":"node_subscription_from_cloudflare_workers.md","mdsource":"https://gist.githubusercontent.com/BruceWind/0bb1894dd7b12607971f75e25d006104/raw/e6ea1d7b166f87daf98dbddf1c2445441dd645cf/node_subscription_from_cloudflare_workers.md","date":"2023-12-08T03:01:04Z","category":"Gists"},"content":"## Subscribing Nodes from Cloudflare Worker to Bypass GFW for Chinese Developers\n\nThis document aims to introduce a method for Chinese developers to bypass the GFW by subscribing proxy nodes\non Cloudflare Worker. \n\nThe GFW is a network firewall implemented by the Chinese government that restricts access\nto certain international websites and services. \n\nEvery Chinese developer need proxy nodes to access development resource.\nWhen you have many proxy nodes, some of them is copied from friends, or some nodes are shared on the internet. \n\nYou want to subscribe them on different device(windows, iOS,Android), at this case, you must know `subconverter`.\nYou can find many services of it that other guys established. \nYou know that using services belongs to others is unsafe. \nSo it is a good idea to use cloudflare worker to hold proxy nodes for private use. \n\n\n### Prerequisites\n\nBefore proceeding, make sure you have the following:\n\n> - A registered Cloudflare account.\n> - Having a domain, because you can not use cloudlfare domain to do so.\n> - Basic knowledge of Cloudflare Worker and how to create and deploy it.\n> - Nodes' URI, whose format like `vmess:`, `vless:`, `http2:`, etc.\n\n### How to Use\n\nThe  steps:\n\n- Register and configure a Cloudflare account: You will need to have a Cloudflare account to utilize the Cloudflare Worker service.\n- Create a Cloudflare Worker and open code edit pager.\n\n- The last step is pasting these code below:\n```\nconst fileContent = \n`vmess://wn4e1LUNGxxxxxxxxx\nhttp2://xxx:xxx@domain:3306#mark\nhttps://xxx:xxx@domain:3306#mark`;\n\naddEventListener('fetch', event => {\n  event.respondWith(handleRequest(event.request))\n})\n\nasync function handleRequest(request) {\n  const url = new URL(request.url)\n  const plainText = url.searchParams.get('plain')\n\n  let responseContent = fileContent\n\n  if (plainText === 'true') {\n    responseContent = fileContent\n  } else {\n    responseContent = btoa(fileContent)\n  }\n\n  const response = new Response(responseContent, {\n    headers: {\n      'Content-Type': 'text/plain',\n    },\n  })\n\n  return response\n}\n\n```\n\nIn the code above, I simply convert nodes into base64 format, which is sufficient for most of my use cases. I do not require Clash or any other specialized clients.\n\nOnce you click the `save and deploy` button, remember to associate a new domain with this worker. Afterwards, you can open the domain in a web browser to access the response from the nodes.\n\nIn other cases, you may want to hide the information, you can try to edit to add some query param like password, which could avoid information leak.","lang":"en"},"__N_SSG":true}