{"pageProps":{"post":{"slug":"hysteriaclientdocker","title":"HysteriaClientDocker","mdsource":"https://raw.githubusercontent.com/BruceWind/HysteriaClientDocker/refs/heads/main/README.md","date":"2021-09-10","category":"Open-source"},"content":"## Hysteria Client Docker\n\n**Languages**: English | [中文说明](README_zh.md)\n\nMost traditional proxy protocols can help in some situations, but they often **do not truly make your internet connection smooth or stable**.  \n**Hysteria** is different: it is designed to keep your connection responsive even on poor or unstable networks, greatly improving everyday browsing and streaming experiences.  \nHowever, there are still **not many clients that conveniently support Hysteria**. This project provides a Docker-based Hysteria client so you can easily benefit from Hysteria on your devices.\n\nThis repository provides a Docker setup for running the Hysteria client. Hysteria is a project designed for secure, high-performance communication.\n\n## Quick Start\n\nTo get started with the Hysteria client in Docker, follow these simple steps:\n\n1. **Add your URLs**: \n   Add one or more Hysteria URLs to `config/urls.txt`. The container\n   will parse every valid line and generate matching config files automatically.\n\n2. **Build and Run with Docker**:\n   Execute the following command in your terminal:\n\n   ```bash\n   docker compose build && docker compose up -d\n   ```\n\nThis command will build the necessary Docker images and start the Hysteria client service.\n\nOn startup the container:\n\n- parses every URL in `config/urls.txt` and generates YAML configs;\n- tests each config on an auxiliary SOCKS port (so that the public `1080/1089`\n  ports stay free) and picks the fastest working option; and\n- launches `boot_with_periordic_tester.py`, which keeps the selected config running on\n  `0.0.0.0:1080` (SOCKS5) and `0.0.0.0:1089` (HTTP) while re-testing every\n  3 minutes on background ports to switch automatically when a better link\n  appears.\n\n### Notes about periodic testing\n\n- **Single URL / single config**:  \n  If `config/urls.txt` effectively results in just one working config, the\n  program will simply use that config to establish the tunnel and will **not\n  enter the periodic \"find best config\" loop**.\n\n- **Short proxy pause when current proxy gets worse**:  \n  If the cached latency for the current proxy becomes noticeably worse, the\n  periodic tester may trigger a full re-evaluation round: the main Hysteria\n  process is briefly stopped while test instances are started on auxiliary\n  ports. In this case the main proxy (`1080/1089`) can stop accepting traffic\n  for roughly **10 seconds** during that window, while it looks for a better\n  config.\n\n\n## Exposed Ports\n\nThe following ports are exposed for communication:\n\n- **SOCKS Port**: `1080`\n- **HTTP Port**: `1089`\n## Environment\n\n- `HYSTERIA_TEST_INTERVAL` (seconds, default `180`): how often the periodic\n  tester reruns connectivity checks in the background while clients use the\n  main proxy ports.\n- `HYSTERIA_TEST_URLS` (comma separated): override the default list of\n  probe endpoints (`https://cp.cloudflare.com/generate_204`,\n  `https://www.bing.com`, `https://www.google.com/generate_204`) used during\n  connectivity tests. This is useful if some sites are blocked in your region.\n\n## Usage\n\nAfter the service is up and running, point your devices at `localhost:1080`\n(SOCKS5) or `localhost:1089` (HTTP) to use the selected Hysteria tunnel.\n\n## Contributing\n\nFeel free to contribute to this project by submitting issues, suggesting features, or creating pull requests.\n\n## Acknowledgements\n\nThis project utilizes the Hysteria client developed by [apernet](https://github.com/apernet/hysteria). Please refer to their documentation for more details on features and usage.","lang":"en"},"__N_SSG":true}